MikroElektronika/core_packages/PIC/XC8/def/PIC18LF25K40/mcu.h
// Register: CRCCON1
#define CRCCON1 CRCCON1
extern volatile unsigned char           CRCCON1             __at(0xF7D);
#ifndef _LIB_BUILD
asm("CRCCON1 equ 0F7Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PLEN                   :4;
        unsigned DLEN                   :4;
    };
    struct {
        unsigned PLEN0                  :1;
        unsigned PLEN1                  :1;
        unsigned PLEN2                  :1;
        unsigned PLEN3                  :1;
        unsigned DLEN0                  :1;
        unsigned DLEN1                  :1;
        unsigned DLEN2                  :1;
        unsigned DLEN3                  :1;
    };
} CRCCON1bits_t;
extern volatile CRCCON1bits_t CRCCON1bits __at(0xF7D);
// bitfield macros
#define _CRCCON1_PLEN_POSN                                  0x0
#define _CRCCON1_PLEN_POSITION                              0x0
#define _CRCCON1_PLEN_SIZE                                  0x4
#define _CRCCON1_PLEN_LENGTH                                0x4
#define _CRCCON1_PLEN_MASK                                  0xF
#define _CRCCON1_DLEN_POSN                                  0x4
#define _CRCCON1_DLEN_POSITION                              0x4
#define _CRCCON1_DLEN_SIZE                                  0x4
#define _CRCCON1_DLEN_LENGTH                                0x4
#define _CRCCON1_DLEN_MASK                                  0xF0
#define _CRCCON1_PLEN0_POSN                                 0x0
#define _CRCCON1_PLEN0_POSITION                             0x0
#define _CRCCON1_PLEN0_SIZE                                 0x1
#define _CRCCON1_PLEN0_LENGTH                               0x1
#define _CRCCON1_PLEN0_MASK                                 0x1
#define _CRCCON1_PLEN1_POSN                                 0x1
#define _CRCCON1_PLEN1_POSITION                             0x1
#define _CRCCON1_PLEN1_SIZE                                 0x1
#define _CRCCON1_PLEN1_LENGTH                               0x1
#define _CRCCON1_PLEN1_MASK                                 0x2
#define _CRCCON1_PLEN2_POSN                                 0x2
#define _CRCCON1_PLEN2_POSITION                             0x2
#define _CRCCON1_PLEN2_SIZE                                 0x1
#define _CRCCON1_PLEN2_LENGTH                               0x1
#define _CRCCON1_PLEN2_MASK                                 0x4
#define _CRCCON1_PLEN3_POSN                                 0x3
#define _CRCCON1_PLEN3_POSITION                             0x3
#define _CRCCON1_PLEN3_SIZE                                 0x1
#define _CRCCON1_PLEN3_LENGTH                               0x1
#define _CRCCON1_PLEN3_MASK                                 0x8
#define _CRCCON1_DLEN0_POSN                                 0x4
#define _CRCCON1_DLEN0_POSITION                             0x4
#define _CRCCON1_DLEN0_SIZE                                 0x1
#define _CRCCON1_DLEN0_LENGTH                               0x1
#define _CRCCON1_DLEN0_MASK                                 0x10
#define _CRCCON1_DLEN1_POSN                                 0x5
#define _CRCCON1_DLEN1_POSITION                             0x5
#define _CRCCON1_DLEN1_SIZE                                 0x1
#define _CRCCON1_DLEN1_LENGTH                               0x1
#define _CRCCON1_DLEN1_MASK                                 0x20
#define _CRCCON1_DLEN2_POSN                                 0x6
#define _CRCCON1_DLEN2_POSITION                             0x6
#define _CRCCON1_DLEN2_SIZE                                 0x1
#define _CRCCON1_DLEN2_LENGTH                               0x1
#define _CRCCON1_DLEN2_MASK                                 0x40
#define _CRCCON1_DLEN3_POSN                                 0x7
#define _CRCCON1_DLEN3_POSITION                             0x7
#define _CRCCON1_DLEN3_SIZE                                 0x1
#define _CRCCON1_DLEN3_LENGTH                               0x1
#define _CRCCON1_DLEN3_MASK                                 0x80

// Register: NVMADR
#define NVMADR NVMADR
extern volatile unsigned char           NVMADR              __at(0xF7E);
#ifndef _LIB_BUILD
asm("NVMADR equ 0F7Eh");
#endif
// aliases
extern volatile unsigned char           NVMADRL             __at(0xF7E);
#ifndef _LIB_BUILD
asm("NVMADRL equ 0F7Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADR                    :8;
    };
    struct {
        unsigned ADR0                   :1;
        unsigned ADR1                   :1;
        unsigned ADR2                   :1;
        unsigned ADR3                   :1;
        unsigned ADR4                   :1;
        unsigned ADR5                   :1;
        unsigned ADR6                   :1;
        unsigned ADR7                   :1;
    };
    struct {
        unsigned NVMADR0                :1;
        unsigned NVMADR1                :1;
        unsigned NVMADR2                :1;
        unsigned NVMADR3                :1;
        unsigned NVMADR4                :1;
        unsigned NVMADR5                :1;
        unsigned NVMADR6                :1;
        unsigned NVMADR7                :1;
    };
    struct {
        unsigned ADRL                   :8;
    };
} NVMADRbits_t;
extern volatile NVMADRbits_t NVMADRbits __at(0xF7E);
// bitfield macros
#define _NVMADR_ADR_POSN                                    0x0
#define _NVMADR_ADR_POSITION                                0x0
#define _NVMADR_ADR_SIZE                                    0x8
#define _NVMADR_ADR_LENGTH                                  0x8
#define _NVMADR_ADR_MASK                                    0xFF
#define _NVMADR_ADR0_POSN                                   0x0
#define _NVMADR_ADR0_POSITION                               0x0
#define _NVMADR_ADR0_SIZE                                   0x1
#define _NVMADR_ADR0_LENGTH                                 0x1
#define _NVMADR_ADR0_MASK                                   0x1
#define _NVMADR_ADR1_POSN                                   0x1
#define _NVMADR_ADR1_POSITION                               0x1
#define _NVMADR_ADR1_SIZE                                   0x1
#define _NVMADR_ADR1_LENGTH                                 0x1
#define _NVMADR_ADR1_MASK                                   0x2
#define _NVMADR_ADR2_POSN                                   0x2
#define _NVMADR_ADR2_POSITION                               0x2
#define _NVMADR_ADR2_SIZE                                   0x1
#define _NVMADR_ADR2_LENGTH                                 0x1
#define _NVMADR_ADR2_MASK                                   0x4
#define _NVMADR_ADR3_POSN                                   0x3
#define _NVMADR_ADR3_POSITION                               0x3
#define _NVMADR_ADR3_SIZE                                   0x1
#define _NVMADR_ADR3_LENGTH                                 0x1
#define _NVMADR_ADR3_MASK                                   0x8
#define _NVMADR_ADR4_POSN                                   0x4
#define _NVMADR_ADR4_POSITION                               0x4
#define _NVMADR_ADR4_SIZE                                   0x1
#define _NVMADR_ADR4_LENGTH                                 0x1
#define _NVMADR_ADR4_MASK                                   0x10
#define _NVMADR_ADR5_POSN                                   0x5
#define _NVMADR_ADR5_POSITION                               0x5
#define _NVMADR_ADR5_SIZE                                   0x1
#define _NVMADR_ADR5_LENGTH                                 0x1
#define _NVMADR_ADR5_MASK                                   0x20
#define _NVMADR_ADR6_POSN                                   0x6
#define _NVMADR_ADR6_POSITION                               0x6
#define _NVMADR_ADR6_SIZE                                   0x1
#define _NVMADR_ADR6_LENGTH                                 0x1
#define _NVMADR_ADR6_MASK                                   0x40
#define _NVMADR_ADR7_POSN                                   0x7
#define _NVMADR_ADR7_POSITION                               0x7
#define _NVMADR_ADR7_SIZE                                   0x1
#define _NVMADR_ADR7_LENGTH                                 0x1
#define _NVMADR_ADR7_MASK                                   0x80
#define _NVMADR_NVMADR0_POSN                                0x0
#define _NVMADR_NVMADR0_POSITION                            0x0
#define _NVMADR_NVMADR0_SIZE                                0x1
#define _NVMADR_NVMADR0_LENGTH                              0x1
#define _NVMADR_NVMADR0_MASK                                0x1
#define _NVMADR_NVMADR1_POSN                                0x1
#define _NVMADR_NVMADR1_POSITION                            0x1
#define _NVMADR_NVMADR1_SIZE                                0x1
#define _NVMADR_NVMADR1_LENGTH                              0x1
#define _NVMADR_NVMADR1_MASK                                0x2
#define _NVMADR_NVMADR2_POSN                                0x2
#define _NVMADR_NVMADR2_POSITION                            0x2
#define _NVMADR_NVMADR2_SIZE                                0x1
#define _NVMADR_NVMADR2_LENGTH                              0x1
#define _NVMADR_NVMADR2_MASK                                0x4
#define _NVMADR_NVMADR3_POSN                                0x3
#define _NVMADR_NVMADR3_POSITION                            0x3
#define _NVMADR_NVMADR3_SIZE                                0x1
#define _NVMADR_NVMADR3_LENGTH                              0x1
#define _NVMADR_NVMADR3_MASK                                0x8
#define _NVMADR_NVMADR4_POSN                                0x4
#define _NVMADR_NVMADR4_POSITION                            0x4
#define _NVMADR_NVMADR4_SIZE                                0x1
#define _NVMADR_NVMADR4_LENGTH                              0x1
#define _NVMADR_NVMADR4_MASK                                0x10
#define _NVMADR_NVMADR5_POSN                                0x5
#define _NVMADR_NVMADR5_POSITION                            0x5
#define _NVMADR_NVMADR5_SIZE                                0x1
#define _NVMADR_NVMADR5_LENGTH                              0x1
#define _NVMADR_NVMADR5_MASK                                0x20
#define _NVMADR_NVMADR6_POSN                                0x6
#define _NVMADR_NVMADR6_POSITION                            0x6
#define _NVMADR_NVMADR6_SIZE                                0x1
#define _NVMADR_NVMADR6_LENGTH                              0x1
#define _NVMADR_NVMADR6_MASK                                0x40
#define _NVMADR_NVMADR7_POSN                                0x7
#define _NVMADR_NVMADR7_POSITION                            0x7
#define _NVMADR_NVMADR7_SIZE                                0x1
#define _NVMADR_NVMADR7_LENGTH                              0x1
#define _NVMADR_NVMADR7_MASK                                0x80
#define _NVMADR_ADRL_POSN                                   0x0
#define _NVMADR_ADRL_POSITION                               0x0
#define _NVMADR_ADRL_SIZE                                   0x8
#define _NVMADR_ADRL_LENGTH                                 0x8
#define _NVMADR_ADRL_MASK                                   0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned ADR                    :8;
    };
    struct {
        unsigned ADR0                   :1;
        unsigned ADR1                   :1;
        unsigned ADR2                   :1;
        unsigned ADR3                   :1;
        unsigned ADR4                   :1;
        unsigned ADR5                   :1;
        unsigned ADR6                   :1;
        unsigned ADR7                   :1;
    };
    struct {
        unsigned NVMADR0                :1;
        unsigned NVMADR1                :1;
        unsigned NVMADR2                :1;
        unsigned NVMADR3                :1;
        unsigned NVMADR4                :1;
        unsigned NVMADR5                :1;
        unsigned NVMADR6                :1;
        unsigned NVMADR7                :1;
    };
    struct {
        unsigned ADRL                   :8;
    };
} NVMADRLbits_t;
extern volatile NVMADRLbits_t NVMADRLbits __at(0xF7E);
// bitfield macros
#define _NVMADRL_ADR_POSN                                   0x0
#define _NVMADRL_ADR_POSITION                               0x0
#define _NVMADRL_ADR_SIZE                                   0x8
#define _NVMADRL_ADR_LENGTH                                 0x8
#define _NVMADRL_ADR_MASK                                   0xFF
#define _NVMADRL_ADR0_POSN                                  0x0
#define _NVMADRL_ADR0_POSITION                              0x0
#define _NVMADRL_ADR0_SIZE                                  0x1
#define _NVMADRL_ADR0_LENGTH                                0x1
#define _NVMADRL_ADR0_MASK                                  0x1
#define _NVMADRL_ADR1_POSN                                  0x1
#define _NVMADRL_ADR1_POSITION                              0x1
#define _NVMADRL_ADR1_SIZE                                  0x1
#define _NVMADRL_ADR1_LENGTH                                0x1
#define _NVMADRL_ADR1_MASK                                  0x2
#define _NVMADRL_ADR2_POSN                                  0x2
#define _NVMADRL_ADR2_POSITION                              0x2
#define _NVMADRL_ADR2_SIZE                                  0x1
#define _NVMADRL_ADR2_LENGTH                                0x1
#define _NVMADRL_ADR2_MASK                                  0x4
#define _NVMADRL_ADR3_POSN                                  0x3
#define _NVMADRL_ADR3_POSITION                              0x3
#define _NVMADRL_ADR3_SIZE                                  0x1
#define _NVMADRL_ADR3_LENGTH                                0x1
#define _NVMADRL_ADR3_MASK                                  0x8
#define _NVMADRL_ADR4_POSN                                  0x4
#define _NVMADRL_ADR4_POSITION                              0x4
#define _NVMADRL_ADR4_SIZE                                  0x1
#define _NVMADRL_ADR4_LENGTH                                0x1
#define _NVMADRL_ADR4_MASK                                  0x10
#define _NVMADRL_ADR5_POSN                                  0x5
#define _NVMADRL_ADR5_POSITION                              0x5
#define _NVMADRL_ADR5_SIZE                                  0x1
#define _NVMADRL_ADR5_LENGTH                                0x1
#define _NVMADRL_ADR5_MASK                                  0x20
#define _NVMADRL_ADR6_POSN                                  0x6
#define _NVMADRL_ADR6_POSITION                              0x6
#define _NVMADRL_ADR6_SIZE                                  0x1
#define _NVMADRL_ADR6_LENGTH                                0x1
#define _NVMADRL_ADR6_MASK                                  0x40
#define _NVMADRL_ADR7_POSN                                  0x7
#define _NVMADRL_ADR7_POSITION                              0x7
#define _NVMADRL_ADR7_SIZE                                  0x1
#define _NVMADRL_ADR7_LENGTH                                0x1
#define _NVMADRL_ADR7_MASK                                  0x80
#define _NVMADRL_NVMADR0_POSN                               0x0
#define _NVMADRL_NVMADR0_POSITION                           0x0
#define _NVMADRL_NVMADR0_SIZE                               0x1
#define _NVMADRL_NVMADR0_LENGTH                             0x1
#define _NVMADRL_NVMADR0_MASK                               0x1
#define _NVMADRL_NVMADR1_POSN                               0x1
#define _NVMADRL_NVMADR1_POSITION                           0x1
#define _NVMADRL_NVMADR1_SIZE                               0x1
#define _NVMADRL_NVMADR1_LENGTH                             0x1
#define _NVMADRL_NVMADR1_MASK                               0x2
#define _NVMADRL_NVMADR2_POSN                               0x2
#define _NVMADRL_NVMADR2_POSITION                           0x2
#define _NVMADRL_NVMADR2_SIZE                               0x1
#define _NVMADRL_NVMADR2_LENGTH                             0x1
#define _NVMADRL_NVMADR2_MASK                               0x4
#define _NVMADRL_NVMADR3_POSN                               0x3
#define _NVMADRL_NVMADR3_POSITION                           0x3
#define _NVMADRL_NVMADR3_SIZE                               0x1
#define _NVMADRL_NVMADR3_LENGTH                             0x1
#define _NVMADRL_NVMADR3_MASK                               0x8
#define _NVMADRL_NVMADR4_POSN                               0x4
#define _NVMADRL_NVMADR4_POSITION                           0x4
#define _NVMADRL_NVMADR4_SIZE                               0x1
#define _NVMADRL_NVMADR4_LENGTH                             0x1
#define _NVMADRL_NVMADR4_MASK                               0x10
#define _NVMADRL_NVMADR5_POSN                               0x5
#define _NVMADRL_NVMADR5_POSITION                           0x5
#define _NVMADRL_NVMADR5_SIZE                               0x1
#define _NVMADRL_NVMADR5_LENGTH                             0x1
#define _NVMADRL_NVMADR5_MASK                               0x20
#define _NVMADRL_NVMADR6_POSN                               0x6
#define _NVMADRL_NVMADR6_POSITION                           0x6
#define _NVMADRL_NVMADR6_SIZE                               0x1
#define _NVMADRL_NVMADR6_LENGTH                             0x1
#define _NVMADRL_NVMADR6_MASK                               0x40
#define _NVMADRL_NVMADR7_POSN                               0x7
#define _NVMADRL_NVMADR7_POSITION                           0x7
#define _NVMADRL_NVMADR7_SIZE                               0x1
#define _NVMADRL_NVMADR7_LENGTH                             0x1
#define _NVMADRL_NVMADR7_MASK                               0x80
#define _NVMADRL_ADRL_POSN                                  0x0
#define _NVMADRL_ADRL_POSITION                              0x0
#define _NVMADRL_ADRL_SIZE                                  0x8
#define _NVMADRL_ADRL_LENGTH                                0x8
#define _NVMADRL_ADRL_MASK                                  0xFF

// Register: NVMDAT
#define NVMDAT NVMDAT
extern volatile unsigned char           NVMDAT              __at(0xF80);
#ifndef _LIB_BUILD
asm("NVMDAT equ 0F80h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMDAT                 :8;
    };
    struct {
        unsigned NVMDAT0                :1;
        unsigned NVMDAT1                :1;
        unsigned NVMDAT2                :1;
        unsigned NVMDAT3                :1;
        unsigned NVMDAT4                :1;
        unsigned NVMDAT5                :1;
        unsigned NVMDAT6                :1;
        unsigned NVMDAT7                :1;
    };
} NVMDATbits_t;
extern volatile NVMDATbits_t NVMDATbits __at(0xF80);
// bitfield macros
#define _NVMDAT_NVMDAT_POSN                                 0x0
#define _NVMDAT_NVMDAT_POSITION                             0x0
#define _NVMDAT_NVMDAT_SIZE                                 0x8
#define _NVMDAT_NVMDAT_LENGTH                               0x8
#define _NVMDAT_NVMDAT_MASK                                 0xFF
#define _NVMDAT_NVMDAT0_POSN                                0x0
#define _NVMDAT_NVMDAT0_POSITION                            0x0
#define _NVMDAT_NVMDAT0_SIZE                                0x1
#define _NVMDAT_NVMDAT0_LENGTH                              0x1
#define _NVMDAT_NVMDAT0_MASK                                0x1
#define _NVMDAT_NVMDAT1_POSN                                0x1
#define _NVMDAT_NVMDAT1_POSITION                            0x1
#define _NVMDAT_NVMDAT1_SIZE                                0x1
#define _NVMDAT_NVMDAT1_LENGTH                              0x1
#define _NVMDAT_NVMDAT1_MASK                                0x2
#define _NVMDAT_NVMDAT2_POSN                                0x2
#define _NVMDAT_NVMDAT2_POSITION                            0x2
#define _NVMDAT_NVMDAT2_SIZE                                0x1
#define _NVMDAT_NVMDAT2_LENGTH                              0x1
#define _NVMDAT_NVMDAT2_MASK                                0x4
#define _NVMDAT_NVMDAT3_POSN                                0x3
#define _NVMDAT_NVMDAT3_POSITION                            0x3
#define _NVMDAT_NVMDAT3_SIZE                                0x1
#define _NVMDAT_NVMDAT3_LENGTH                              0x1
#define _NVMDAT_NVMDAT3_MASK                                0x8
#define _NVMDAT_NVMDAT4_POSN                                0x4
#define _NVMDAT_NVMDAT4_POSITION                            0x4
#define _NVMDAT_NVMDAT4_SIZE                                0x1
#define _NVMDAT_NVMDAT4_LENGTH                              0x1
#define _NVMDAT_NVMDAT4_MASK                                0x10
#define _NVMDAT_NVMDAT5_POSN                                0x5
#define _NVMDAT_NVMDAT5_POSITION                            0x5
#define _NVMDAT_NVMDAT5_SIZE                                0x1
#define _NVMDAT_NVMDAT5_LENGTH                              0x1
#define _NVMDAT_NVMDAT5_MASK                                0x20
#define _NVMDAT_NVMDAT6_POSN                                0x6
#define _NVMDAT_NVMDAT6_POSITION                            0x6
#define _NVMDAT_NVMDAT6_SIZE                                0x1
#define _NVMDAT_NVMDAT6_LENGTH                              0x1
#define _NVMDAT_NVMDAT6_MASK                                0x40
#define _NVMDAT_NVMDAT7_POSN                                0x7
#define _NVMDAT_NVMDAT7_POSITION                            0x7
#define _NVMDAT_NVMDAT7_SIZE                                0x1
#define _NVMDAT_NVMDAT7_LENGTH                              0x1
#define _NVMDAT_NVMDAT7_MASK                                0x80

// Register: NVMCON1
#define NVMCON1 NVMCON1
extern volatile unsigned char           NVMCON1             __at(0xF81);
#ifndef _LIB_BUILD
asm("NVMCON1 equ 0F81h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD                     :1;
        unsigned WR                     :1;
        unsigned WREN                   :1;
        unsigned WRERR                  :1;
        unsigned FREE                   :1;
        unsigned                        :1;
        unsigned NVMREG                 :2;
    };
    struct {
        unsigned                        :6;
        unsigned NVMREG0                :1;
        unsigned NVMREG1                :1;
    };
} NVMCON1bits_t;
